import numpy as np
from numpy.linalg import norm

'''
Задача 1

𝑁 хоббитов делят 𝐾 кусков эльфийского хлеба поровну, не делящийся нацело остаток остается в корзинке у Сэма.
Напишите функцию, которая принимает на вход параметры 𝑁 и 𝐾 и возвращает два числа:
𝑥 - cколько кусков эльфиского хлеба достанется каждому хоббиту, и 𝑦 - сколько кусков остаётся в корзинке.
'''
def share_bread(N, K):
    x = K // N
    y = K % N
    return x, y

assert share_bread(N=3, K=14) == (4, 2)


'''
Задача 2

В копях Мории хоббиты нашли стену, на которой высечены разные натуральные числа.
Согласно древним сказаниям, это даты сражений. Хоббиты знают, что сражения происходили только по високосным годам.
Помогите хоббитам определить, является ли год с данным числом датой великого сражения.
Если это так, то верните строку "YOU SHALL PASS", иначе верните "YOU SHALL NOT PASS".
Напомним, что в соответствии с хоббитским календарем, 
год является високосным, если его номер кратен 4, но не кратен 100, а также если он кратен 400.
'''


def leap_year(year):
    text_result = (
        (lambda x: ["YOU SHALL NOT PASS", "YOU SHALL PASS"][(x % 4 == 0 and x % 100 != 0) and x % 400 == 0])(year))
    return text_result


assert leap_year(5) == 'YOU SHALL NOT PASS'
print(leap_year(5))

'''
Задача 3
'''


def amulet_area(a, b, c):
    p = (a + b + c) / 2
    S = int((p * (p - a) * (p - b) * (p - c)) ** 0.5)
    return S


assert amulet_area(3, 4, 5) == 6
print(amulet_area(3, 4, 5))

'''
=========================================================================================================
Задача 4
Хоббиты собираются пешком идти до Мордора и им нужно подсчитать расстояние, которое им предстоит пройти. 
Хоббиты смогли вспомнить сразу несколько метрик расстояния: евклидово, манхэттена и косинусное, 
так что ваша задача - напистаь функцию под каждую из них. 
Важное условие - используйте только базовые функции numpy для решения.
'''

def cal_euclidean(a, b):    # Евклидово расстояние (базовые функции numpy)

    distance = (np.sum((a-b)**2))**0.5
    return distance


def cal_manhattan(a, b):  # Расстояние Манхэттена (базовые функции numpy)
    distance = np.sum(np.abs(a-b))
    return distance
#
#
def cal_cosine(a, b):   # Косинусное расстояние (базовые функции numpy)
    distance = 1 - ( (np.dot(a, b))/(norm(a) * norm(b)) )
    return distance


a = np.random.randint(-10, 10, size=10)
b = np.random.randint(-10, 10, size=10)
print(cal_euclidean(a, b))
print(cal_manhattan(a, b))
print(cal_cosine(a, b))

'''
Задача 5
Ну и напоследок, еще немного практики numpy, без которой не обходится ни один хоббит.

Создайте случайный array (np.random.rand()) длинной 100. Преобразуйте его так, чтобы

    Максимальный элемент(ы) был равен 1
    Минимальный элемент(ы) был равен 0
    Остальные элементы в итнтервале от 0 до 1 остаются прежними
'''

my_array = np.random.rand(100)
my_array[-1] = 1
my_array[0] = 0
print(np.max(my_array), np.min(my_array))
print(my_array)

'''
Создайте array размером 5×6
с целыми числами в интервале [0,50].
Напечатайте колонку, которая содержит максимальный элемент полученной матрицы 
'''
t = np.arange(50)
my_array = np.random.choice(t, 30, replace=False)
y = max(my_array)
my_array.resize(5, 6, refcheck=False)
lin = my_array.transpose()
for row in lin:
    if y in row:
        selected_column = (row.reshape(5,1))
print('Shape: ',my_array.shape)
print('Array')
print(my_array)
print(selected_column)


'''
Напишите функцию, которая принимает на вохд матрицу (array) X и возвращает все её уникальные строки в виде новой матрицы.
'''

# def get_unique_rows(X):
#     # Your code here
#     return X_unique
#
# X = np.random.randint(4, 6, size=(10,3))
# print(X)
# # get_unique_rows(X)

